Revit 2027 API
BalusterPattern.GetBalusterCount Method
 Gets the number of balusters in the main baluster pattern definition.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetBalusterCount()
Public Function GetBalusterCount As Integer
public:
int GetBalusterCount()
member GetBalusterCount : unit -> int
Return Value
Int32
 The number of balusters in the main baluster pattern.
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace